const baseUrl = {
	developmentUrl: {
		host1: "http://api.995120.cn/hww/", //生产         业务码
		host2: "/" ,
//		host1: "http://api-test.995120.cn/hww/", //开发          业务码
//		host2: "/" ,                              //开发            直连
//		    host1: 'http://122.224.133.53:9090',      //测试           业务码
//		    host2: '',      //测试             直连
		//    host1: 'http://192.168.1.76:2100' ,      //陈明培         业务码
		//    host2: 'http://192.168.1.76:2090',
		//    host2: 'http://192.168.1.76:2020' ,      //陈明培          直连
		//    host1: 'http://192.168.1.93:2010' ,      //左云飞          业务码
		//    host2: 'http://192.168.1.93:2090' ,      //左云飞          直连
		//    host1: 'http://192.168.1.96:2010',       //祝伟峰           业务码
		//    host2: 'http://192.168.1.96:2020',       //祝伟峰           直连
		//	  host1: 'http://192.168.1.66:2090/comm/',       //姚明炯          业务码
		//	  host2: 'http://192.168.1.66:2010',       //姚明炯         直连
		//	  host1: 'http://192.168.1.74:2090/comm/',       //梁宝龙          业务码
		//	  host2: 'http://192.168.1.74:2020',       //梁宝龙         直连
		//	  host1: 'http://192.168.1.75:2130/hww/',       //陈伟          业务码
		//		  host2: 'http://192.168.1.75:2130',       //陈伟         直连
		//		  host1: 'http://192.168.1.65:2130/hww/',       //曹广军          业务码
		//		  host2: 'http://192.168.1.65:2130',       //曹广军         直连
	},
	productionUrl: {
		host: "http://localhost:7000/"
	}
};
export default baseUrl;