<template>
	<div class="hw_privacy">
		<div class="privacy_box">
			<p class="title">隐私协议</p>
			<p class="art_content">好络维严格遵守法律法规，遵循以下隐私保护原则，为您提供更加安全、可靠的服务：</p>
			<p class="art_content">1、您在平台注册的账户具有密码保护功能，以确保您基本信息资料的安全，请您妥善保管账户及密码信息。</p>
			<p class="art_content">2、好络维努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您存储在平台中的信息和通信内容不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。好络维会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，好络维将在任何时候尽力做到使您的信息不被泄漏、毁损或丢失， 但同时也请您注意在信息网络上不存在绝对完善的安全措施，请妥善保管好相关信息。</p>
			<p class="art_content">3、好络维有权根据实际情况自行决定您在本软件及服务中数据的最长储存期限、服务器中数据的最大存储空间等，您应当保管好终端、账号及密码，并妥善保管相关信息和内容，好络维对您自身原因导致的数据丢失或被盗以及在本软件及服务中相关数据的删除或储存失败不承担责任。</p>
			<p class="art_content">4、您在使用我们的服务时，我们可能会收集和使用您的信息，在此，我们会向您说明在您使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。</p>
			<p class="strong">（1）我们收集的信息</p>
			<p class="art_content">我们提供服务时，可能会收集、储存和使用下列与您有关的信息，包括您提供的信息、其他方分享的您的信息以及我们获取的您的信息等。如果您不提供相关信息，可能无法注册成为我们的用户、享受我们提供的某些服务，或者即便我们可以继续向您提供一些服务，也无法达到该服务拟达到的效果。</p>
			<p class="strong">（2）您提供的信息</p>
			<p class="art_content">您在注册我们的账户或使用我们的服务时，向我们提供的相关个人信息，例如姓名、年龄、家庭住址、电话号码、电子邮件和银行卡号等；</p>
			<p class="art_content">您在注册我们的账户或使用我们的服务时，向我们提供的相关个人健康信息（包括健康数据），包括但不限于您的身高、体重、体脂、血压、心电、健康史等；</p>
			<p class="art_content">您通过我们的服务向我们或其他方提供的共享信息，以及您使用我们的服务时所储存的信息。</p>
			<p class="art_content">您通过其他方提供的服务向其他方提供的个人健康信息（包括健康数据），在其他方与我们进行业务合作且您注册为我们的用户或使用我们的服务时，即表明您同意将提供给其他方的个人健康信息（包括健康数据）同时提供给我们。</p>
			<p class="art_content">您通过我们的客服或参加我们举办的活动时所提交的信息。例如，您参与我们线上活动时填写的调查问卷中可能包含您的姓名、电话、家庭地址等信息。我们的部分服务可能需要您提供特定的个人敏感信息来实现特定功能。若您选择不提供该类信息，则可能无法正常使用服务中的特定功能，但不影响您使用服务中的其他功能。若您主动提供您的个人敏感信息，即表示您同意我们按本政策所述目的和方式来处理您的个人敏感信息。</p>
			<p class="strong">（3）其他方分享的您的信息</p>
			<p class="art_content">其他方使用我们的服务时所提供有关您的共享信息。</p>
			<p class="art_content">（4）手表上传的信息</p>
			<p class="art_content">通过ECG表带上传的心电数据，我们会将数据发送给华为运动健康平台，用于心电分析。</p>
			<p class="strong">（5）我们获取的您的信息</p>
			<p class="art_content">您使用我们服务时我们可能收集如下信息：</p>
			<p class="art_content">日志信息指您使用我们服务时，系统可能会通过cookies、web beacon或其他方式自动采集的技术信息，包括：</p>
			<p class="art_content">设备或软件信息，例如您的移动设备、网页浏览器或您用于接入我们的服务的其他程序所提供的配置信息、您的IP地址和您的移动设备所用的版本和设备识别码；</p>
			<p class="art_content">您在使用我们服务时搜索和浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；</p>
			<p class="art_content">有关您曾使用的移动客户端软件和其他软件的信息，以及您曾经使用该等移动客户端软件的信息；</p>
			<p class="art_content">您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长；及您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等。</p>
			<p class="art_content">位置信息指您开启设备定位功能并使用我们基于位置提供的相关服务时，我们收集的有关您位置的信息，包括：</p>
			<p class="art_content">您通过具有定位功能的移动设备使用我们的服务时，我们通过GPS、WLAN(如WiFi)、IP地址或基站等途径收集的您的地理位置信息；</p>
			<p class="art_content">您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息，例如您或其他人共享的照片包含的地理标记信息；以及您可以通过关闭定位功能随时停止我们对您的地理位置信息的收集。</p>
			<p class="strong">（6）我们如何使用您的信息</p>
			<p class="art_content">我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：</p>
			<p class="art_content">向您提供服务；</p>
			<p class="art_content">在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；</p>
			<p class="art_content">帮助我们设计新服务，改善我们现有服务；</p>
			<p class="art_content">使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他使用我们服务的用户作出其他方面的回应；</p>
			<p class="art_content">软件认证或管理软件升级；</p>
			<p class="art_content">让您参与有关我们产品和服务的调查。</p>
			<p class="art_content">为了让我们的用户有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过我们的某一项服务所收集的个人信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的您的个人信息，可能在另一服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息。如我们在相关服务之中提供了相应选项，您也可以主动要求我们将您在该服务所提供和储存的个人信息用于我们的其他服务。</p>
			<p class="art_content">针对某些特定服务的特定个人信息保护声明将更具体地说明我们在该等服务中如何使用您的信息。</p>
			<p class="art_content">为了确保服务的安全，帮助我们更好地了解我们应用程序的运行情况，我们可能记录相关信息，例如，您使用应用程序的频率、故障信息、总体使用情况、性能数据以及应用程序的来源。我们不会将我们存储在分析软件中的信息与您在应用程序中提供的个人身份信息相结合。</p>
			<p class="strong">（6）如何访问和控制您的信息</p>
			<p class="art_content">我们将尽量采取适当的技术手段，保证您可以访问、更新和更正您的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除您的个人信息时，我们可能会要求您进行身份验证，以保障您的账户安全。</p>
			<p class="art_content">对于通过cookies和web beacon收集的您的信息，我们还在以下“COOKIES、日志档案和WEB BEACON”部分说明了向您提供的选择机制。</p>
			<p class="strong">（7）我们如何分享您的信息</p>
			<p class="art_content">除以下情形外，未经您同意，我们以及我们的关联公司不会与任何第三方分享您的个人信息：</p>
			<p class="art_content">我们以及我们的关联公司可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、以及为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在法域），用作下列用途：</p>
			<p class="art_content">向您提供我们的服务实现“我们如何使用您的信息”部分所述目的履行我们在《好络维用户服务协议》或本《个人信息保护声明》中的义务和行使我们的权利；及理解、维护和改善我们的服务。</p>
			<p class="art_content">如我们或我们的关联公司与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《个人信息保护声明》及我们要求其遵守的其他适当的保密和安全措施。</p>
			<p class="art_content">随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，而您的个人信息有可能作为此类交易的一部分而被转移。我们将在您的个人信息转移前以推送通知、公告等形式通知您。</p>
			<p class="art_content">我们或我们的关联公司还可能为以下需要保留、保存或披露您的个人信息：</p>
			<p class="art_content">遵守适用的法律法规；</p>
			<p class="art_content">遵守法院命令或其他法律程序的规定；</p>
			<p class="art_content">遵守相关政府机关或其他法定授权组织的要求；</p>
			<p class="art_content">及我们认为为遵守适用的法律法规、维护社会公共利益、或保护我们或我们的集团公司、我们的客户、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途。</p>
			<p class="art_content">我们会将所收集到的信息用于大数据分析。例如，我们将收集到的信息用于分析形成不包含任何个人信息的城市热力图或行业洞察报告。我们可能对外公开并与我们的合作伙伴分享经统计加工后不含身份识别内容的信息，用于了解用户如何使用我们服务或让公众了解我们服务的总体使用趋势。</p>
			<p class="strong">（8）我们如何保留、储存和保护您的信息</p>
			<p class="art_content">我们仅在本《个人信息保护声明》所述目的所必需期间和法律法规要求的时限内保留您的个人信息。</p>
			<p class="art_content">我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）匿名化处理等手段来保护您向我们提供的个人信息。但请您谅解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。</p>
			<p class="strong">（9）有关共享信息的提示</p>
			<p class="art_content">我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是我们的社交媒体服务，是专为使您可以与世界各地的用户共享信息而设计，从而使共享信息可实时、广泛的传递。只要您不删除共享信息，有关信息便一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。</p>
			<p class="art_content">因此，请您认真考虑您通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您的共享信息的用户范围。如您要求从我们的服务中删除您的个人信息，请通过该等特别服务条款提供的方式操作。请您理解，由于技术所限、法律或监管要求，我们可能无法满足您的所有要求，我们会在合理的期限内答复您的请求。</p>
			<p class="strong">（10）有关敏感个人信息的提示</p>
			<p class="art_content">您的个人健康和医疗信息因其特殊性可能被认为是敏感个人信息，相比其他个人信息，敏感个人信息受到更加严格的保护。</p>
			<p class="art_content">请注意，您在我们的服务中所提供、上传或发布的内容和信息，可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否使用我们的服务披露您的敏感个人信息。</p>
			<p class="art_content">您同意您的敏感个人信息按本《个人信息保护声明》所述的目的和方式来处理。</p>
			<p class="strong">（11）我们服务中的第三方服务</p>
			<p class="art_content">我们的服务可能包括来自第三方例如：</p>
			<p class="art_content">您可利用 “分享”键将某些内容分享到我们的服务，或您可利用第三方连线服务登录我们的服务。这些功能可能会收集您的信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；及我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站。</p>
			<p class="art_content last">该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受第三方自己的服务条款及个人信息保护声明（而非《好贴心用户服务协议》或本《个人信息保护声明》）约束，您需要仔细阅读其条款。本《个人信息保护声明》仅适用于我们所收集的任何信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，而我们对任何第三方使用由您提供的信息不承担任何责任。</p>
		</div>
	</div>
</template>

<script>
</script>

<style>
		.hw_privacy{
			width: 100%;
			background: #f2f2f2;
		}
		.hw_privacy .privacy_box{
			font-size: 14px;
			width: 94%;
			background: #FFFFFF;
			margin-left: 3%;
			padding-top: 8px;
		}
		.hw_privacy .title{
			text-align: center;
			font-weight: bold;
			padding-top: 8px;
		}
		.hw_privacy .strong{
			font-weight: bold;
			margin-left: 1%;
			margin-top: 8px;
			line-height: 20px;
		}
		.hw_privacy .art_content{
			margin-left: 1%;
			margin-top: 8px;
			line-height: 20px;
		}
		.hw_privacy .last{
			padding-bottom: 8px;
			padding-bottom: 8px;
		}
</style>