<template>
	<div class="hw_services">
		<div class="services_box">
			<p class="title">用户服务协议</p>
			<p class="strong">欢迎使用浙江好络维医疗技术有限公司（以下简称“好络维”）提供的“心电监测服务”（以下简称“好络维服务”或“服务”）！</p>
			<p class="strong">提示：在使用服务之前，您应当认真阅读并遵守《好络维用户服务协议》（以下简称“本协议”）以及《隐私政策条款》，请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。免除或者限制责任的条款可能将以加粗字体显示，您应重点阅读。</p>
			<p class="strong">当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他好络维允许的方式实际使用本服务时，即表示您已充分阅读、理解并接受本协议的全部内容，本协议即产生法律约束力。您承诺接受并遵守本协议的约定，届时您不应以未阅读本协议的内容或者未获得好络维对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</p>
			<p class="strong"></p>
			<p class="strong">一、缔约主体</p>
			<p class="art_content">本协议由通过华为运动健康APP提供的心电监测服务的用户（以下简称“用户”或“您”）与浙江好络维医疗技术有限公司共同缔结。</p>
			<p class="strong">二、协议内容和效力</p>
			<p class="art_content">1、本协议内容包括本协议正文及所有好络维已经发布或将来可能发布的隐私政策、各项政策、规则、声明、通知、警示、提示、说明（以下简称“规则”）。前述规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。</p>
			<p class="art_content">2、好络维有权根据需要不时制订、修改本协议及相关规则，变更后的协议和规则一经公布，立即取代原协议及规则并自动生效。如您不同意相关变更，应当立即停止使用好络维服务，如您继续使用华为运动健康APP提供的心电监测服务服务或进行任何平台活动，即表示您已接受经修订的协议和规则。</p>
			<p class="strong">三、服务内容</p>
			<p class="art_content">1、好络维在华为运动健康APP中提供的心电监测服务，好络维可能会不断丰富您使用本服务的形式等（具体以好络维提供的为准），如您已注册使用一种形式的服务，则可以以同一账号使用其他版本服务，本协议自动适用于您对所有版本的软件和服务的使用。</p>
			<p class="art_content">2、好络维许可您对好络维健康管理平台软件进行非排他性的使用，您可以制作本软件的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息，本条及本协议其他条款未明示授权的其他一切权利仍由好络维保留，您在行使这些权利时须另外取得好络维的书面许可。好络维如果未行使前述任何权利，并不构成对该权利的放弃。</p>
			<p class="art_content">3、本服务内容包含用户健康服务、健康资讯等功能，这些功能服务可能根据公司运营策略的变化、用户需求的变化，随着因服务版本不同、或服务提供方的单方判断而被优化或修改，或因定期、不定期的维护而暂缓提供。</p>
			<p class="art_content">4、好络维在服务中提供的AI心电自动分析结果仅供参考，不作为医疗诊断依据。</p>
			<p class="art_content">5、同时，好络维保留在任何时候自行决定对服务或服务任何部分及其相关功能、应用软件变更、升级、修改、转移的权利。您同意，对于上述行为，好络维均不需通知，并且对您和任何第三人不承担任何责任。</p>
			<p class="strong">四、注册及账号管理</p>
			<p class="art_content">1、您确认，在您完成注册程序或以其他好络维允许的方式实际使用服务时，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用服务，否则您及您的监护人应承担因此而导致的一切后果，且好络维有权注销（永久冻结）您的账户，并向您及您的监护人索赔。如您代表一家公司或其他法律主体进行注册或以其他好络维允许的方式实际使用本服务，则您声明和保证，您有权使该公司或该法律主体受本协议“条款“的约束。</p>
			<p class="art_content">2、您注册时应提交真实、准确、完整和反映当前情况的身份及其他相关信息，您可以使用您提供或确认的手机号或者好络维允许的其它方式作为账号进行注册，同时系统将为您自动分配一个平台用户号，您可以将平台用户号修改为您喜欢的昵称。您理解并同意，您承诺注册的账号名称、设置的昵称、头像和简介等信息中不得出现违法和不良信息，不得冒充他人进行注册，不得未经许可为他人注册，不得以可能导致其他用户误认的方式注册账号或设置昵称，不得使用可能侵犯他人权益的昵称（包括但不限于涉嫌商标权、名誉权侵权等），否则好络维有权不予注册或停止服务并收回账号及平台用户号，因此产生的损失由您自行承担。</p>
			<p class="art_content">3、您了解并同意，平台注册账号所有权归属于好络维，注册完成后，您仅获得账号使用权。账号使用权仅归属于初始申请注册人，不得以任何方式转让或被提供予他人使用，否则，好络维有权立即不经通知收回该账号，由此带来的因您使用本服务产生的全部数据、信息等被清空、丢失等的损失，您应自行承担。</p>
			<p class="art_content">4、在您成功注册后，好络维将根据账号和密码确认您的身份。您应妥善保管您的终端设备及账户和密码，并对利用该账户和密码所进行的一切活动（包括但不限于网上点击同意或提交各类规则协议、绑定智能设备、购买商品/服务、发表/回复话题、添加图片等）负全部责任。您承诺，在密码或账户遭到未获授权的使用，或者发生其他任何安全问题时，将立即通知好络维，且您同意并确认，好络维不对上述情形产生的任何直接或间接的遗失或损害承担责任。除非有法律规定或司法裁定，且征得好络维的同意，否则，您的账户、密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。</p>
			<p class="art_content">5、您了解并同意，如您注册平台账号后连续超过12个月未登录，好络维为平台优化管理之目的有权回收该账号，相关问题及责任均由您自行承担。</p>
			<p class="art_content">6、好络维根据本协议收回或取消账号后，有权自行对账号相关内容及信息以包括但不限于删除等方式进行处理，且无需就此向用户承担任何责任。</p>
			<p class="art_content">7、特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受被盗号或密码失窃，责任由您自行承担。</p>
			<p class="strong">五、服务使用规范</p>
			<p class="art_content">1、用户充分了解并同意，好络维仅为用户提供心电监测和分析服务，您应自行对利用服务从事的所有行为及结果承担责任。相应地，您应了解，使用好络维在华为运动健康APP提供的心电监测服务可能发生来自他人非法或不当行为（或信息）的风险，您应自行判断及行动，并自行承担相应的风险。</p>
			<p class="art_content">2、您应自行承担因使用服务所产生的费用，包括但不限于上网流量费、通信服务费等。</p>
			<p class="art_content">3、除非另有说明，本协议项下的服务只能用于非商业用途。您承诺不对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于包括但不限于广告及任何其它商业目的。</p>
			<p class="art_content">4、您承诺不会利用本服务进行任何违法或不当的活动，包括但不限于下列行为:</p>
			<p class="art_content">4.1 上载、传送或分享含有下列内容之一的信息：</p>
			<p class="art_content">(a) 反对宪法所确定的基本原则的；</p>
			<p class="art_content">(b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；</p>
			<p class="art_content">(c) 损害国家荣誉和利益的；</p>
			<p class="art_content">(d) 煽动民族仇恨、民族歧视、破坏民族团结的；</p>
			<p class="art_content">(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
			<p class="art_content">(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
			<p class="art_content">(g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；</p>
			<p class="art_content">(h) 侮辱或者诽谤他人，侵害他人合法权利的；</p>
			<p class="art_content">(i) 含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；</p>
			<p class="art_content">(j) 含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；</p>
			<p class="art_content">4.2 冒充任何人或机构，或以虚伪不实的方式陈述或谎称与任何人或机构有关；</p>
			<p class="art_content">4.3 伪造标题或以其他方式操控识别资料，使人误认为该内容为好络维或其关联公司所传送；</p>
			<p class="art_content">4.4 将依据任何法律或合约或法定关系（例如由于雇佣关系和依据保密合约所得知或揭露之内部资料、专属及机密资料）知悉但无权传送之任何内容加以上载、传送或分享；</p>
			<p class="art_content">4.5 将涉嫌侵害他人权利（包括但不限于著作权、专利权、商标权、商业秘密等知识产权、肖像权等）之内容上载、传送或分享；</p>
			<p class="art_content">4.6 跟踪或以其它方式骚扰他人, 或通过本服务向好友或其他用户发送大量信息；</p>
			<p class="art_content">4.7 将任何广告、推广信息、促销资料、“垃圾邮件”、“滥发信件”、“连锁信件”、“直销”或其它任何形式的劝诱资料加以上载、传送或分享；供前述目的使用的专用区域或专用功能除外；</p>
			<p class="art_content">4.8 本服务仅为用户健康目的及日常使用目的设计，且相关服务结果仅作为参考，您不可将本服务用于包括但不限于核设施、军事用途、医疗诊断、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，好络维不承担法律责任；</p>
			<p class="art_content">4.9 进行任何超出正常的用户之间内部或外部信息沟通、交流等目的的行为；</p>
			<p class="art_content">4.10 出于超出用户之间内部或外部信息沟通、交流等目的（包括但不限于为发送广告、垃圾、骚扰或违法违规等信息的目的），通过本服务向其他用户发送大量信息；</p>
			<p class="art_content">4.11 违反遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的行为；</p>
			<p class="art_content">4.12 从事任何违反中国法律、法规、规章、政策及规范性文件的行为。</p>
			<p class="art_content">5、您承诺不对本软件和服务从事以下行为：</p>
			<p class="art_content">5.1 将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；</p>
			<p class="art_content">5.2 干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；</p>
			<p class="art_content">5.3 通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；</p>
			<p class="art_content">5.4 通过非好络维开发、授权的第三方软件、插件、外挂、系统，登录或使用软件及服务，或制作、发布、传播上述工具；</p>
			<p class="art_content">5.5 自行、授权他人或利用第三方软件对本软件及其组件、模块、数据等进行干扰。</p>
			<p class="art_content">6、您承诺，使用好络维服务时您将严格遵守本协议(包括本协议第一条所述规则)。</p>
			<p class="art_content">7、您同意并接受好络维无须时时监控您下载、传送或分享的资料及信息，但好络维有权对您使用服务的情况进行审查、监督并采取相应行动，包括但不限于删除信息、中止或终止服务，及向有关机关报告。</p>
			<p class="art_content">8、您同意并接受好络维心电服务中包含的心电采集手表采集您的心电数据，并将数据自动上传至好络维健康数据分析平台用于心电分析。</p>
			<p class="art_content">9、您承诺不以任何形式使用本服务侵犯好络维的商业利益，或从事任何可能对好络维造成损害或不利于好络维的行为。</p>
			<p class="art_content">10、您了解并同意，在好络维服务提供过程中，好络维及其关联公司或其授权单位和个人有权以各种方式投放各种商业性广告或其他任何类型的推广信息，同时，您同意接受以手机短信、电子邮件或其他方式向您发送的上述广告或推广信息。</p>
			<p class="art_content">11、您充分了解并同意，您必须为自己注册帐号下的一切行为负责，包括您所发表的任何内容、使用本服务购买商品/服务的行为以及由此产生的任何后果。您应对使用本服务时接触到的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。好络维无法且不会对您因前述风险而导致的任何损失或损害承担责任。</p>
			<p class="art_content">12、如果好络维发现或收到他人举报您有违反本协议约定的，好络维有权不经通知随时对相关内容进行删除、屏蔽，并采取包括但不限于收回账号，限制、暂停、终止您使用部分或全部本服务，追究法律责任等措施。</p>
			<p class="strong">六、服务费用</p>
			<p class="art_content">1、本服务的任何免费试用或免费功能和服务不应视为好络维放弃后续收费的权利。好络维有权提前7天以公告形式通知您收费标准，若您继续使用则需按好络维公布的收费标准支付费用。</p>
			<p class="art_content">2、所有费用需通过好络维接受的支付方式事先支付。前述使用费不包含其它任何费用或相关汇款等支出，否则您应补足付款或自行支付该费用。</p>
			<p class="art_content">3、好络维有权根据实际情况提前7天单方调整费用标准及收费方式，并以公告形式通知您，而无需获得您的事先同意，如您不同意收费应当立即停止服务的使用，否则使用则视为您已同意且应当缴纳费用。</p>
			<p class="art_content">4、您应当自行支付使用本服务可能产生的上网费以及其他第三方收取的通讯费、信息费等。</p>
			<p class="art_content">5、您理解并同意，在使用本软件中的服务需要进行语音/视频服务时，好络维方需通过电信运营商提供的网络提供服务，运营商在某些情况下可能向用户收取一定通信费用（如用户处于异地漫游状态时需支付漫游接听费用）。</p>
			<p class="art_content">6、您理解并知悉，您在使用平台部分服务时，包括音频、视频等服务时，需要消耗您的流量，好络维会对此作出提示，您继续使用服务视为您对消耗流量的同意。</p>
			<p class="strong">七、特别授权</p>
			<p class="art_content">1、当您向好络维关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺，则好络维有权立即按您的承诺约定的方式对您的账户采取限制措施，包括但不限于中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，好络维无须就相关确认与您核对事实，或另行征得您的同意，且好络维无须就此限制措施或公示行为向您承担任何的责任。</p>
			<p class="art_content">2、一旦您违反本协议或与好络维签订的其他协议的约定，好络维有权以任何方式通知好络维关联公司，要求其对您的权益采取限制措施，包括但不限于要求好络维关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。</p>
			<p class="strong">八、第三方服务</p>
			<p class="art_content">1、好络维允许第三方服务接入平台，您可以在好络维直接获得第三方服务。您了解并同意，好络维仅作为平台提供者，相关服务由该第三方独立提供，好络维不对您对该服务的使用承担任何责任。</p>
			<p class="art_content">2、您了解并同意，如好络维对服务或其部分做出调整、中止或终止而对第三方服务产生影响，好络维不承担任何责任。</p>
			<p class="art_content">3、您使用平台接受第三方服务时，好络维可能会调用第三方系统或者通过第三方支持您的使用或访问，使用或访问的结果由该第三方提供。</p>
			<p class="strong">九、服务中止或终止</p>
			<p class="art_content">1、您同意，鉴于互联网服务的特殊性，好络维有权随时中止、终止或致使中止终止服务或其任何部分；对于免费服务之中止或终止，好络维无需向您发出通知。</p>
			<p class="art_content">2、您了解并同意，好络维可能定期或不定期地对提供网络服务的平台设备、设施和软硬件进行维护或检修，如因此类情况而造成收费服务在合理时间内中止，好络维无需承担责任，但应尽可能事先进行通告。</p>
			<p class="art_content">3、如存在下列违约情形之一，好络维可立即对用户中止或终止服务，并要求用户赔偿损失：</p>
			<p class="art_content">3.1 用户违反第四条之注册义务；</p>
			<p class="art_content">3.2 用户使用收费网络服务时未按规定支付相应服务费；</p>
			<p class="art_content last">3.3 用户违反第五条服务使用规范之规定。</p>
		</div>
	</div>
</template>

<script>
</script>

<style>
		.hw_services{
			width: 100%;
			background: #f2f2f2;
		}
		.hw_services .services_box{
			font-size: 14px;
			width: 94%;
			background: #FFFFFF;
			margin-left: 3%;
			padding-top: 8px;
		}
		.hw_services .title{
			text-align: center;
			font-weight: bold;
			padding-top: 8px;
		}
		.hw_services .strong{
			font-weight: bold;
			margin-left: 1%;
			margin-top: 8px;
			line-height: 20px;
		}
		.hw_services .art_content{
			margin-left: 1%;
			margin-top: 8px;
			line-height: 20px;
		}
		.hw_services .last{
			padding-bottom: 8px;
			padding-bottom: 8px;
		}
</style>