<template>
  <div class="agreement">
    <section class="agreement-article">
      <p class="title">用户服务协议</p>
      <p class="article">
        <strong
          >欢迎使用浙江好络维医疗技术有限公司（以下简称“好络维”）提供的“心电监测服务”（以下简称“好络维服务”或“服务”）！</strong
        >
      </p>
      <p class="article">
        <strong
          >提示：在使用服务之前，您应当认真阅读并遵守《好络维用户服务协议》（以下简称“本协议”）以及《隐私政策条款》，请您务必审慎阅读、充分理解各条款内容，特别是免除或者限制责任的条款、争议解决和法律适用条款。免除或者限制责任的条款可能将以加粗字体显示，您应重点阅读。</strong
        >
      </p>
      <p class="article">
        <strong
          >当您按照注册页面提示填写信息、阅读并同意本协议且完成全部注册程序后，或您按照激活页面提示填写信息、阅读并同意本协议且完成全部激活程序后，或您以其他好络维允许的方式实际使用本服务时，即表示您已充分阅读、理解并接受本协议的全部内容，本协议即产生法律约束力。您承诺接受并遵守本协议的约定，届时您不应以未阅读本协议的内容或者未获得好络维对您问询的解答等理由，主张本协议无效，或要求撤销本协议。</strong
        >
      </p>
      <p class="article">
        <strong>一、缔约主体</strong>
      </p>
      <p class="article">
        本协议由通过华为运动健康APP提供的心电监测服务的用户（以下简称“用户”或“您”）与浙江好络维医疗技术有限公司共同缔结。
      </p>
      <p class="article">
        <strong>二、协议内容和效力</strong>
      </p>
      <p class="article">
        1、本协议内容包括本协议正文及所有好络维已经发布或将来可能发布的隐私政策、各项政策、规则、声明、通知、警示、提示、说明（以下简称“规则”）。前述规则为本协议不可分割的组成部分，与协议正文具有同等法律效力。
      </p>
      <p class="article">
        <strong
          >2、好络维有权根据需要不时制订、修改本协议及相关规则，变更后的协议和规则一经公布，立即取代原协议及规则并自动生效。如您不同意相关变更，应当立即停止使用好络维服务，如您继续使用华为运动健康APP提供的心电监测服务服务或进行任何平台活动，即表示您已接受经修订的协议和规则。</strong
        >
      </p>
      <p class="article">
        <strong>三、服务内容</strong>
      </p>
      <p class="article">
        1、好络维在华为运动健康APP中提供的心电监测服务，好络维可能会不断丰富您使用本服务的形式等（具体以好络维提供的为准），如您已注册使用一种形式的服务，则可以以同一账号使用其他版本服务，本协议自动适用于您对所有版本的软件和服务的使用。
      </p>
      <p class="article">
        2、好络维许可您对好络维健康管理平台软件进行非排他性的使用，您可以制作本软件的一个副本，仅用作备份。备份副本必须包含原软件中含有的所有著作权信息，本条及本协议其他条款未明示授权的其他一切权利仍由好络维保留，您在行使这些权利时须另外取得好络维的书面许可。好络维如果未行使前述任何权利，并不构成对该权利的放弃。
      </p>
      <p class="article">
        3、本服务内容包含用户健康服务、健康资讯等功能，这些功能服务可能根据公司运营策略的变化、用户需求的变化，随着因服务版本不同、或服务提供方的单方判断而被优化或修改，或因定期、不定期的维护而暂缓提供。
      </p>
      <p class="article">
        <strong
          >4、好络维在服务中提供的AI心电自动分析结果仅供参考，不作为医疗诊断依据。</strong
        >
      </p>
      <p class="article">
        <strong
          >5、同时，好络维保留在任何时候自行决定对服务或服务任何部分及其相关功能、应用软件变更、升级、修改、转移的权利。您同意，对于上述行为，好络维均不需通知，并且对您和任何第三人不承担任何责任。</strong
        >
      </p>
      <p class="article">
        <strong>四、注册及账号管理</strong>
      </p>
      <p class="article">
        1、您确认，在您完成注册程序或以其他好络维允许的方式实际使用服务时，您应当是具备完全民事权利能力和与所从事的民事行为相适应的行为能力的自然人、法人或其他组织。若您不具备前述主体资格，请勿使用服务，否则您及您的监护人应承担因此而导致的一切后果，且好络维有权注销（永久冻结）您的账户，并向您及您的监护人索赔。如您代表一家公司或其他法律主体进行注册或以其他好络维允许的方式实际使用本服务，则您声明和保证，您有权使该公司或该法律主体受本协议“条款“的约束。
      </p>
      <p class="article">
        2、您注册时应提交真实、准确、完整和反映当前情况的身份及其他相关信息，您可以使用您提供或确认的手机号或者好络维允许的其它方式作为账号进行注册，同时系统将为您自动分配一个平台用户号，您可以将平台用户号修改为您喜欢的昵称。您理解并同意，您承诺注册的账号名称、设置的昵称、头像和简介等信息中不得出现违法和不良信息，不得冒充他人进行注册，不得未经许可为他人注册，不得以可能导致其他用户误认的方式注册账号或设置昵称，不得使用可能侵犯他人权益的昵称（包括但不限于涉嫌商标权、名誉权侵权等），否则好络维有权不予注册或停止服务并收回账号及平台用户号，因此产生的损失由您自行承担。
      </p>
      <p class="article">
        3、您了解并同意，平台注册账号所有权归属于好络维，注册完成后，您仅获得账号使用权。账号使用权仅归属于初始申请注册人，不得以任何方式转让或被提供予他人使用，否则，好络维有权立即不经通知收回该账号，由此带来的因您使用本服务产生的全部数据、信息等被清空、丢失等的损失，您应自行承担。
      </p>
      <p class="article">
        4、在您成功注册后，好络维将根据账号和密码确认您的身份。您应妥善保管您的终端设备及账户和密码，并对利用该账户和密码所进行的一切活动（包括但不限于网上点击同意或提交各类规则协议、绑定智能设备、购买商品/服务、发表/回复话题、添加图片等）负全部责任。您承诺，在密码或账户遭到未获授权的使用，或者发生其他任何安全问题时，将立即通知好络维，且您同意并确认，好络维不对上述情形产生的任何直接或间接的遗失或损害承担责任。除非有法律规定或司法裁定，且征得好络维的同意，否则，您的账户、密码不得以任何方式转让、赠与或继承（与账户相关的财产权益除外）。
      </p>
      <p class="article">
        <strong
          >5、您了解并同意，如您注册平台账号后连续超过12个月未登录，好络维为平台优化管理之目的有权回收该账号，相关问题及责任均由您自行承担。</strong
        >
      </p>
      <p class="article">
        <strong
          >6、好络维根据本协议收回或取消账号后，有权自行对账号相关内容及信息以包括但不限于删除等方式进行处理，且无需就此向用户承担任何责任。</strong
        >
      </p>
      <p class="article">
        <strong
          >7、特别提醒您应妥善保管您的帐号和密码。当您使用完毕后，应安全退出。因您保管不善可能导致遭受被盗号或密码失窃，责任由您自行承担。</strong
        >
      </p>
      <p class="article">
        <strong>五、服务使用规范</strong>
      </p>
      <p class="article">
        1、用户充分了解并同意，好络维仅为用户提供心电监测和分析服务，您应自行对利用服务从事的所有行为及结果承担责任。相应地，您应了解，使用好络维在华为运动健康APP提供的心电监测服务可能发生来自他人非法或不当行为（或信息）的风险，您应自行判断及行动，并自行承担相应的风险。
      </p>
      <p class="article">
        2、您应自行承担因使用服务所产生的费用，包括但不限于上网流量费、通信服务费等。
      </p>
      <p class="article">
        3、除非另有说明，本协议项下的服务只能用于非商业用途。您承诺不对本服务任何部分或本服务之使用或获得，进行复制、拷贝、出售、转售或用于包括但不限于广告及任何其它商业目的。
      </p>
      <p class="article">
        4、您承诺不会利用本服务进行任何违法或不当的活动，包括但不限于下列行为:
      </p>
      <p class="article">4.1 上载、传送或分享含有下列内容之一的信息：</p>
      <p class="article">(a) 反对宪法所确定的基本原则的；</p>
      <p class="article">
        (b) 危害国家安全，泄露国家秘密，颠覆国家政权，破坏国家统一的；
      </p>
      <p class="article">(c) 损害国家荣誉和利益的；</p>
      <p class="article">(d) 煽动民族仇恨、民族歧视、破坏民族团结的；</p>
      <p class="article">(e) 破坏国家宗教政策，宣扬邪教和封建迷信的；</p>
      <p class="article">(f) 散布谣言，扰乱社会秩序，破坏社会稳定的；</p>
      <p class="article">
        (g) 散布淫秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的；
      </p>
      <p class="article">(h) 侮辱或者诽谤他人，侵害他人合法权利的；</p>
      <p class="article">
        (i)
        含有虚假、诈骗、有害、胁迫、侵害他人隐私、骚扰、侵害、中伤、粗俗、猥亵、或其它道德上令人反感的内容；
      </p>
      <p class="article">
        (j)
        含有中国法律、法规、规章、条例以及任何具有法律效力之规范所限制或禁止的其它内容的；
      </p>
      <p class="article">
        4.2 冒充任何人或机构，或以虚伪不实的方式陈述或谎称与任何人或机构有关；
      </p>
      <p class="article">
        4.3
        伪造标题或以其他方式操控识别资料，使人误认为该内容为好络维或其关联公司所传送；
      </p>
      <p class="article">
        4.4
        将依据任何法律或合约或法定关系（例如由于雇佣关系和依据保密合约所得知或揭露之内部资料、专属及机密资料）知悉但无权传送之任何内容加以上载、传送或分享；
      </p>
      <p class="article">
        4.5
        将涉嫌侵害他人权利（包括但不限于著作权、专利权、商标权、商业秘密等知识产权、肖像权等）之内容上载、传送或分享；
      </p>
      <p class="article">
        4.6 跟踪或以其它方式骚扰他人, 或通过本服务向好友或其他用户发送大量信息；
      </p>
      <p class="article">
        4.7
        将任何广告、推广信息、促销资料、“垃圾邮件”、“滥发信件”、“连锁信件”、“直销”或其它任何形式的劝诱资料加以上载、传送或分享；供前述目的使用的专用区域或专用功能除外；
      </p>
      <p class="article">
        4.8
        本服务仅为用户健康目的及日常使用目的设计，且相关服务结果仅作为参考，您不可将本服务用于包括但不限于核设施、军事用途、医疗诊断、交通通讯等重要领域。如果因为软件或服务的原因导致上述操作失败而带来的人员伤亡、财产损失和环境破坏等，好络维不承担法律责任；
      </p>
      <p class="article">
        4.9 进行任何超出正常的用户之间内部或外部信息沟通、交流等目的的行为；
      </p>
      <p class="article">
        4.10
        出于超出用户之间内部或外部信息沟通、交流等目的（包括但不限于为发送广告、垃圾、骚扰或违法违规等信息的目的），通过本服务向其他用户发送大量信息；
      </p>
      <p class="article">
        4.11
        违反遵守法律法规、社会主义制度、国家利益、公民合法利益、公共秩序、社会道德风尚和信息真实性等“七条底线”要求的行为；
      </p>
      <p class="article">
        4.12 从事任何违反中国法律、法规、规章、政策及规范性文件的行为。
      </p>
      <p class="article">5、您承诺不对本软件和服务从事以下行为：</p>
      <p class="article">
        5.1
        将有关干扰、破坏或限制任何计算机软件、硬件或通讯设备功能的软件病毒或其他计算机代码、档案和程序之资料，加以上载、张贴、发送电子邮件或以其他方式传送；
      </p>
      <p class="article">
        5.2
        干扰或破坏本服务或与本服务相连线之服务器和网络，或违反任何关于本服务连线网络之规定、程序、政策或规范；
      </p>
      <p class="article">
        5.3
        通过修改或伪造软件运行中的指令、数据，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的；
      </p>
      <p class="article">
        5.4
        通过非好络维开发、授权的第三方软件、插件、外挂、系统，登录或使用软件及服务，或制作、发布、传播上述工具；
      </p>
      <p class="article">
        5.5
        自行、授权他人或利用第三方软件对本软件及其组件、模块、数据等进行干扰。
      </p>
      <p class="article">
        6、您承诺，使用好络维服务时您将严格遵守本协议(包括本协议第一条所述规则)。
      </p>
      <p class="article">
        7、您同意并接受好络维无须时时监控您下载、传送或分享的资料及信息，但好络维有权对您使用服务的情况进行审查、监督并采取相应行动，包括但不限于删除信息、中止或终止服务，及向有关机关报告。
      </p>
      <p class="article">
        <strong
          >8、您同意并接受好络维心电服务中包含的心电采集手表采集您的心电数据，并将数据自动上传至好络维健康数据分析平台用于心电分析。</strong
        >
      </p>
      <p class="article">
        9、您承诺不以任何形式使用本服务侵犯好络维的商业利益，或从事任何可能对好络维造成损害或不利于好络维的行为。
      </p>
      <p class="article">
        10、您了解并同意，在好络维服务提供过程中，好络维及其关联公司或其授权单位和个人有权以各种方式投放各种商业性广告或其他任何类型的推广信息，同时，您同意接受以手机短信、电子邮件或其他方式向您发送的上述广告或推广信息。
      </p>
      <p class="article">
        11、您充分了解并同意，您必须为自己注册帐号下的一切行为负责，包括您所发表的任何内容、使用本服务购买商品/服务的行为以及由此产生的任何后果。您应对使用本服务时接触到的内容自行加以判断，并承担因使用内容而引起的所有风险，包括因对内容的正确性、完整性或实用性的依赖而产生的风险。好络维无法且不会对您因前述风险而导致的任何损失或损害承担责任。
      </p>
      <p class="article">
        12、如果好络维发现或收到他人举报您有违反本协议约定的，好络维有权不经通知随时对相关内容进行删除、屏蔽，并采取包括但不限于收回账号，限制、暂停、终止您使用部分或全部本服务，追究法律责任等措施。
      </p>
      <p class="article">
        <strong>六、服务费用</strong>
      </p>
      <p class="article">
        1、本服务的任何免费试用或免费功能和服务不应视为好络维放弃后续收费的权利。好络维有权提前7天以公告形式通知您收费标准，若您继续使用则需按好络维公布的收费标准支付费用。
      </p>
      <p class="article">
        2、所有费用需通过好络维接受的支付方式事先支付。前述使用费不包含其它任何费用或相关汇款等支出，否则您应补足付款或自行支付该费用。
      </p>
      <p class="article">
        3、好络维有权根据实际情况提前7天单方调整费用标准及收费方式，并以公告形式通知您，而无需获得您的事先同意，如您不同意收费应当立即停止服务的使用，否则使用则视为您已同意且应当缴纳费用。
      </p>
      <p class="article">
        4、您应当自行支付使用本服务可能产生的上网费以及其他第三方收取的通讯费、信息费等。
      </p>
      <p class="article">
        <strong
          >5、您理解并同意，在使用本软件中的服务需要进行语音/视频服务时，好络维方需通过电信运营商提供的网络提供服务，运营商在某些情况下可能向用户收取一定通信费用（如用户处于异地漫游状态时需支付漫游接听费用）。</strong
        >
      </p>
      <p class="article">
        <strong
          >6、您理解并知悉，您在使用平台部分服务时，包括音频、视频等服务时，需要消耗您的流量，好络维会对此作出提示，您继续使用服务视为您对消耗流量的同意。</strong
        >
      </p>
      <p class="article">
        <strong>七、特别授权</strong>
      </p>
      <p class="article">
        <strong
          >1、当您向好络维关联公司作出任何形式的承诺，且相关公司已确认您违反了该承诺，则好络维有权立即按您的承诺约定的方式对您的账户采取限制措施，包括但不限于中止或终止向您提供服务，并公示相关公司确认的您的违约情况。您了解并同意，好络维无须就相关确认与您核对事实，或另行征得您的同意，且好络维无须就此限制措施或公示行为向您承担任何的责任。</strong
        >
      </p>
      <p class="article">
        <strong
          >2、一旦您违反本协议或与好络维签订的其他协议的约定，好络维有权以任何方式通知好络维关联公司，要求其对您的权益采取限制措施，包括但不限于要求好络维关联公司中止、终止对您提供部分或全部服务，且在其经营或实际控制的任何网站公示您的违约情况。</strong
        >
      </p>
      <p class="article">
        <strong>八、第三方服务</strong>
      </p>
      <p class="article">
        1、好络维允许第三方服务接入平台，您可以在好络维直接获得第三方服务。您了解并同意，好络维仅作为平台提供者，相关服务由该第三方独立提供，好络维不对您对该服务的使用承担任何责任。
      </p>
      <p class="article">
        2、您了解并同意，如好络维对服务或其部分做出调整、中止或终止而对第三方服务产生影响，好络维不承担任何责任。
      </p>
      <p class="article">
        3、您使用平台接受第三方服务时，好络维可能会调用第三方系统或者通过第三方支持您的使用或访问，使用或访问的结果由该第三方提供。
      </p>
      <p class="article">
        <strong>九、服务中止或终止</strong>
      </p>
      <p class="article">
        <strong
          >1、您同意，鉴于互联网服务的特殊性，好络维有权随时中止、终止或致使中止终止服务或其任何部分；对于免费服务之中止或终止，好络维无需向您发出通知。</strong
        >
      </p>
      <p class="article">
        <strong
          >2、您了解并同意，好络维可能定期或不定期地对提供网络服务的平台设备、设施和软硬件进行维护或检修，如因此类情况而造成收费服务在合理时间内中止，好络维无需承担责任，但应尽可能事先进行通告。</strong
        >
      </p>
      <p class="article">
        <strong
          >3、如存在下列违约情形之一，好络维可立即对用户中止或终止服务，并要求用户赔偿损失：</strong
        >
      </p>
      <p class="article">
        <strong>3.1 用户违反第四条之注册义务；</strong>
      </p>
      <p class="article">
        <strong>3.2 用户使用收费网络服务时未按规定支付相应服务费；</strong>
      </p>
      <p class="article">
        <strong>3.3 用户违反第五条服务使用规范之规定。</strong>
      </p>
      <p class="article">
        <strong>十、隐私政策</strong>
      </p>
      <p class="article">
      	好络维严格遵守法律法规，遵循以下隐私保护原则，为您提供更加安全、可靠的服务：
      </p>
      <p class="article">
        1、您在平台注册的账户具有密码保护功能，以确保您基本信息资料的安全，请您妥善保管账户及密码信息。
      </p>
      <p class="article">
        2、好络维努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您存储在平台中的信息和通信内容不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。我们对可能接触到信息的员工或外包人员也采取了严格管理，包括但不限于根据岗位的不同采取不同的权限控制，与他们签署保密协议，监控他们的操作情况等措施。好络维会按现有技术提供相应的安全措施来保护您的信息，提供合理的安全保障，好络维将在任何时候尽力做到使您的信息不被泄漏、毁损或丢失，
        但同时也请您注意在信息网络上不存在绝对完善的安全措施，请妥善保管好相关信息。
      </p>
      <p class="article">
        3、好络维有权根据实际情况自行决定您在本软件及服务中数据的最长储存期限、服务器中数据的最大存储空间等，您应当保管好终端、账号及密码，并妥善保管相关信息和内容，好络维对您自身原因导致的数据丢失或被盗以及在本软件及服务中相关数据的删除或储存失败不承担责任。
      </p>
      <p class="article">
        4、您在使用我们的服务时，我们可能会收集和使用您的信息，在此，我们会向您说明在您使用我们的服务时，我们如何收集、使用、储存和分享这些信息，以及我们为您提供的访问、更新、控制和保护这些信息的方式。
      </p>
      <p class="article">
        <strong>（1）我们收集的信息</strong>
      </p>
      <p class="article">
        我们提供服务时，可能会收集、储存和使用下列与您有关的信息，包括您提供的信息、其他方分享的您的信息以及我们获取的您的信息等。如果您不提供相关信息，可能无法注册成为我们的用户、享受我们提供的某些服务，或者即便我们可以继续向您提供一些服务，也无法达到该服务拟达到的效果。
      </p>
      <p class="article">
        <strong>（2）您提供的信息</strong>
      </p>
      <p class="article">
        您在注册我们的账户或使用我们的服务时，向我们提供的相关个人信息，例如姓名、年龄、家庭住址、电话号码、电子邮件和银行卡号等；
      </p>
      <p class="article">
        您在注册我们的账户或使用我们的服务时，向我们提供的相关个人健康信息（包括健康数据），包括但不限于您的身高、体重、体脂、血压、心电、健康史等；
      </p>
      <p class="article">
        您通过我们的服务向我们或其他方提供的共享信息，以及您使用我们的服务时所储存的信息。
      </p>
      <p class="article">
        您通过其他方提供的服务向其他方提供的个人健康信息（包括健康数据），在其他方与我们进行业务合作且您注册为我们的用户或使用我们的服务时，即表明您同意将提供给其他方的个人健康信息（包括健康数据）同时提供给我们。
      </p>
      <p class="article">
        您通过我们的客服或参加我们举办的活动时所提交的信息。例如，您参与我们线上活动时填写的调查问卷中可能包含您的姓名、电话、家庭地址等信息。我们的部分服务可能需要您提供特定的个人敏感信息来实现特定功能。若您选择不提供该类信息，则可能无法正常使用服务中的特定功能，但不影响您使用服务中的其他功能。若您主动提供您的
        <strong>个人敏感信息</strong
        >，即表示您同意我们按本政策所述目的和方式来处理您的个人敏感信息。
      </p>
      <p class="article">
        <strong>（3）其他方分享的您的信息</strong>
      </p>
      <p class="article">其他方使用我们的服务时所提供有关您的共享信息。</p>
      <p class="article">
        <strong>（4）手表上传的信息</strong>
      </p>
      <p class="article">通过ECG表带上传的心电数据，我们会将数据发送给华为运动健康平台，用于心电分析。</p>
      <p class="article">
        <strong>（5）我们获取的您的信息</strong>
      </p>
      <p class="article">您使用我们服务时我们可能收集如下信息：</p>
      <p class="article">
        日志信息指您使用我们服务时，系统可能会通过cookies、web
        beacon或其他方式自动采集的技术信息，包括：
      </p>
      <p class="article">
        设备或软件信息，例如您的移动设备、网页浏览器或您用于接入我们的服务的其他程序所提供的配置信息、您的IP地址和您的移动设备所用的版本和设备识别码
      </p>
      <p class="article">
        您在使用我们服务时搜索和浏览的信息，例如您使用的网页搜索词语、访问的社交媒体页面url地址，以及您在使用我们服务时浏览或要求提供的其他信息和内容详情；
      </p>
      <p class="article">
        有关您曾使用的移动客户端软件和其他软件的信息，以及您曾经使用该等移动客户端软件的信息；
      </p>
      <p class="article">
        您通过我们的服务进行通讯的信息，例如曾通讯的账号，以及通讯时间、数据和时长；及您通过我们的服务分享的内容所包含的信息（元数据），例如拍摄或上传的共享照片或录像的日期、时间或地点等。
      </p>
      <p class="article">
        位置信息指您开启设备定位功能并使用我们基于位置提供的相关服务时，我们收集的有关您位置的信息，包括：
      </p>
      <p class="article">
        您通过具有定位功能的移动设备使用我们的服务时，我们通过GPS、WLAN(如WiFi)、IP地址或基站等途径收集的您的地理位置信息；
      </p>
      <p class="article">
        您或其他用户提供的包含您所处地理位置的实时信息，例如您提供的账户信息中包含的您所在地区信息，您或其他人上传的显示您当前或曾经所处地理位置的共享信息，例如您或其他人共享的照片包含的地理标记信息；以及您可以通过关闭定位功能随时停止我们对您的地理位置信息的收集。
      </p>
      <p class="article">
        <strong>（6）我们如何使用您的信息</strong>
      </p>
      <p class="article">
        我们可能将在向您提供服务的过程之中所收集的信息用作下列用途：
      </p>
      <p class="article">向您提供服务；</p>
      <p class="article">
        在我们提供服务时，用于身份验证、客户服务、安全防范、诈骗监测、存档和备份用途，确保我们向您提供的产品和服务的安全性；
      </p>
      <p class="article">帮助我们设计新服务，改善我们现有服务；</p>
      <p class="article">
        使我们更加了解您如何接入和使用我们的服务，从而针对性地回应您的个性化需求，例如语言设定、位置设定、个性化的帮助服务和指示，或对您和其他使用我们服务的用户作出其他方面的回应；
      </p>
      <p class="article">软件认证或管理软件升级；</p>
      <p class="article">让您参与有关我们产品和服务的调查。</p>
      <p class="article">
        为了让我们的用户有更好的体验、改善我们的服务或您同意的其他用途，在符合相关法律法规的前提下，我们可能将通过我们的某一项服务所收集的个人信息，以汇集信息或者个性化的方式，用于我们的其他服务。例如，在您使用我们的一项服务时所收集的您的个人信息，可能在另一服务中用于向您提供特定内容或向您展示与您相关的、而非普遍推送的信息。如我们在相关服务之中提供了相应选项，您也可以主动要求我们将您在该服务所提供和储存的个人信息用于我们的其他服务。
      </p>
      <p class="article">
        针对某些特定服务的特定个人信息保护声明将更具体地说明我们在该等服务中如何使用您的信息。
      </p>
      <p class="article">
        为了确保服务的安全，帮助我们更好地了解我们应用程序的运行情况，我们可能记录相关信息，例如，您使用应用程序的频率、故障信息、总体使用情况、性能数据以及应用程序的来源。我们不会将我们存储在分析软件中的信息与您在应用程序中提供的个人身份信息相结合。
      </p>
      <p class="article">
        <strong>（7）如何访问和控制您的信息</strong>
      </p>
      <p class="article">
        我们将尽量采取适当的技术手段，保证您可以访问、更新和更正您的注册信息或使用我们的服务时提供的其他个人信息。在访问、更新、更正和删除您的个人信息时，我们可能会要求您进行身份验证，以保障您的账户安全。
      </p>
      <p class="article">
        对于通过cookies和web
        beacon收集的您的信息，我们还在以下“COOKIES、日志档案和WEB
        BEACON”部分说明了向您提供的选择机制。
      </p>
      <p class="article">
        <strong>（8）我们如何分享您的信息</strong>
      </p>
      <p class="article">
        除以下情形外，未经您同意，我们以及我们的关联公司不会与任何第三方分享您的个人信息：
      </p>
      <p class="article">
        我们以及我们的关联公司可能将您的个人信息与我们的关联公司、合作伙伴及第三方服务供应商、承包商及代理（例如代表我们发出电子邮件或推送通知的通讯服务提供商、以及为我们提供位置数据的地图服务供应商）分享（他们可能并非位于您所在法域），用作下列用途：
      </p>
      <p class="article">
        向您提供我们的服务实现“我们如何使用您的信息”部分所述目的履行我们在《好络维用户服务协议》或本《个人信息保护声明》中的义务和行使我们的权利；及理解、维护和改善我们的服务。
      </p>
      <p class="article">
        如我们或我们的关联公司与任何上述第三方分享您的个人信息，我们将努力确保该等第三方在使用您的个人信息时遵守本《个人信息保护声明》及我们要求其遵守的其他适当的保密和安全措施。
      </p>
      <p class="article">
        随着我们业务的持续发展，我们以及我们的关联公司有可能进行合并、收购、资产转让或类似的交易，而您的个人信息有可能作为此类交易的一部分而被转移。我们将在您的个人信息转移前以推送通知、公告等形式通知您。
      </p>
      <p class="article">
        我们或我们的关联公司还可能为以下需要保留、保存或披露您的个人信息：
      </p>
      <p class="article">遵守适用的法律法规；</p>
      <p class="article">遵守法院命令或其他法律程序的规定；</p>
      <p class="article">遵守相关政府机关或其他法定授权组织的要求；</p>
      <p class="article">
        及我们认为为遵守适用的法律法规、维护社会公共利益、或保护我们或我们的集团公司、我们的客户、其他用户或雇员的人身和财产安全或合法权益所合理必需的用途。
      </p>
      <p class="article">
        我们会将所收集到的信息用于大数据分析。例如，我们将收集到的信息用于分析形成不包含任何个人信息的城市热力图或行业洞察报告。我们可能对外公开并与我们的合作伙伴分享经统计加工后不含身份识别内容的信息，用于了解用户如何使用我们服务或让公众了解我们服务的总体使用趋势。
      </p>
      <p class="article">
        <strong>（9）我们如何保留、储存和保护您的信息</strong>
      </p>
      <p class="article">
        我们仅在本《个人信息保护声明》所述目的所必需期间和法律法规要求的时限内保留您的个人信息。
      </p>
      <p class="article">
        我们使用各种安全技术和程序，以防信息的丢失、不当使用、未经授权阅览或披露。例如，在某些服务中，我们将利用加密技术（例如SSL）匿名化处理等手段来保护您向我们提供的个人信息。但请您谅解，由于技术的限制以及风险防范的局限，即便我们已经尽量加强安全措施，也无法始终保证信息百分之百的安全。您需要了解，您接入我们的服务所用的系统和通讯网络，有可能因我们可控范围外的情况而发生问题。
      </p>
      <p class="article">
        <strong>（10）有关共享信息的提示</strong>
      </p>
      <p class="article">
        我们的多项服务可让您不仅与您的社交网络、也与使用该服务的所有用户公开分享您的相关信息，例如，您在我们的服务中所上传或发布的信息（包括您公开的个人信息、您建立的名单）、您对其他人上传或发布的信息作出的回应，以及包括与这些信息有关的位置数据和日志信息。使用我们服务的其他用户也有可能分享与您有关的信息（包括位置数据和日志信息）。特别是我们的社交媒体服务，是专为使您可以与世界各地的用户共享信息而设计，从而使共享信息可实时、广泛的传递。只要您不删除共享信息，有关信息便一直留存在公众领域；即使您删除共享信息，有关信息仍可能由其他用户或不受我们控制的非关联第三方独立地缓存、复制或储存，或由其他用户或该等第三方在公众领域保存。
      </p>
      <p class="article">
        因此，请您认真考虑您通过我们的服务上传、发布和交流的信息内容。在一些情况下，您可通过我们某些服务的隐私设定来控制有权浏览您的共享信息的用户范围。如您要求从我们的服务中删除您的个人信息，请通过该等特别服务条款提供的方式操作。请您理解，由于技术所限、法律或监管要求，我们可能无法满足您的所有要求，我们会在合理的期限内答复您的请求。
      </p>
      <p class="article">
        <strong>（11）有关敏感个人信息的提示</strong>
      </p>
      <p class="article">
        您的个人健康和医疗信息因其特殊性可能被认为是敏感个人信息，相比其他个人信息，敏感个人信息受到更加严格的保护。
      </p>
      <p class="article">
        请注意，您在我们的服务中所提供、上传或发布的内容和信息，可能会泄露您的敏感个人信息。您需要谨慎地考虑，是否使用我们的服务披露您的敏感个人信息。
      </p>
      <p class="article">
        您同意您的敏感个人信息按本《个人信息保护声明》所述的目的和方式来处理。
      </p>
      <p class="article">
        <strong>（12）我们服务中的第三方服务</strong>
      </p>
      <p class="article">我们的服务可能包括来自第三方例如：</p>
      <p class="article">
        您可利用
        “分享”键将某些内容分享到我们的服务，或您可利用第三方连线服务登录我们的服务。这些功能可能会收集您的信息（包括您的日志信息），并可能在您的电脑装置cookies，从而正常运行上述功能；及我们通过广告或我们服务的其他方式向您提供链接，使您可以接入第三方的服务或网站。
      </p>
      <p class="article">
        该等第三方社交媒体或其他服务可能由相关的第三方或我们运营。您使用该等第三方的社交媒体服务或其他服务（包括您向该等第三方提供的任何个人信息），须受第三方自己的服务条款及个人信息保护声明（而非《好贴心用户服务协议》或本《个人信息保护声明》）约束，您需要仔细阅读其条款。本《个人信息保护声明》仅适用于我们所收集的任何信息，并不适用于任何第三方提供的服务或第三方的信息使用规则，而我们对任何第三方使用由您提供的信息不承担任何责任。
      </p>
      <p class="article">
        <strong>十一、知识产权</strong>
      </p>
      <p class="article">
        1、您了解及同意，除非好络维另行声明，本协议项下服务包含的所有产品、技术、软件、程序、数据及其他信息（包括但不限于文字、图像、图片、照片、音频、视频、图表、色彩、版面设计、电子文档）的所有知识产权（包括但不限于版权、商标权、专利权、商业秘密等）及相关权利均归好络维或其关联公司所有。
      </p>
      <p class="article">
        2、您应保证，除非取得好络维书面授权，对于上述权利您不得（并不得允许任何第三人）实施包括但不限于出租、出借、出售、散布、复制、修改、转载、汇编、发表、出版、还原工程、反向汇编、反向编译，或以其它方式发现原始码等的行为。
      </p>
      <p class="article">
        3、好络维服务涉及的Logo、“好络维”等文字、图形及其组成，以及好络维其他标识、徵记、产品和服务名称均为好络维及其关联公司在中国和其它国家的商标或商业标识，用户未经好络维书面授权不得以任何方式展示、使用或作其他处理，也不得向他人表明您有权展示、使用、或作其他处理。
      </p>
      <p class="article">
        <strong
          >4、您理解并同意授权好络维在宣传和推广中使用您的名称、商标、标识，但仅限于表明您属于我们的客户或合作伙伴。</strong
        >
      </p>
      <p class="article">
        <strong>十二、有限责任</strong>
      </p>
      <p class="article">
        <strong
          >1、服务将按"现状"和按"可得到"的状态提供。好络维在此明确声明对服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性，没有错误或疏漏、持续性、准确性、可靠性，适用于某一特定用途之类的保证、声明或承诺。</strong
        >
      </p>
      <p class="article">
        <strong
          >2、好络维对服务所涉的技术和信息的有效性、准确性、正确性、可靠性、质量、稳定、完整和及时性均不作承诺和保证。</strong
        >
      </p>
      <p class="article">
        <strong
          >3、不论在何种情况下，好络维均不对由于Internet连接故障，电脑、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、不可抗力、战争、政府行为、国际及国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。</strong
        >
      </p>
      <p class="article">
        <strong
          >4、不论是否可以预见，不论是源于何种形式的行为，好络维不对由以下原因造成的任何特别的，直接的，间接的，惩罚性的，突发性的或有因果关系的损害或其他任何损害（包括但不限于利润或利息的损失，营业中止，资料灭失）承担责任。</strong
        >
      </p>
      <p class="article">
        <strong>4.1 使用或不能使用服务；</strong>
      </p>
      <p class="article">
        <strong
          >4.2
          通过服务购买或获取任何产品、样品、数据、信息或进行交易等，或其他可替代上述行为的行为而产生的费用；</strong
        >
      </p>
      <p class="article">
        <strong>4.3 未经授权的存取或修改数据或数据的传输；</strong>
      </p>
      <p class="article">
        <strong>4.4 第三方通过服务所作的陈述或行为；</strong>
      </p>
      <p class="article">
        <strong>4.5 其它与服务相关事件，包括疏忽等，所造成的损害。</strong>
      </p>
      <p class="article">
        <strong
          >5、您充分了解并同意，鉴于互联网体制及环境的特殊性，您在服务中分享的信息及个人资料有可能会被他人复制、转载、擅改或做其它非法用途；您在此已充分意识此类风险的存在，并确认此等风险应完全由您自行承担，好络维对此不承担任何责任。</strong
        >
      </p>
      <p class="article">
        <strong
          >6、您了解并同意，在使用服务过程中可能存在来自任何他人的包括威胁性的、诽谤性的、令人反感的或非法的内容或行为或对他人权利的侵犯（包括知识产权）及匿名或冒名的信息的风险，基于服务使用规范所述，该等风险应由您自行承担，好络维对此不承担任何责任。</strong
        >
      </p>
      <p class="article">
        <strong>十三、违约责任及赔偿</strong>
      </p>
      <p class="article">
        <strong
          >1、如果好络维发现或收到他人举报您有违反本协议约定的，好络维有权不经通知随时对相关内容进行删除、屏蔽，并采取包括但不限于限制、暂停、终止您使用平台账号及部分或全部服务，采取追究法律责任等措施。</strong
        >
      </p>
      <p class="article">
        <strong
          >2、您同意，由于您通过服务上载、传送或分享之信息、使用本服务其他功能、违反本协议、或您侵害他人任何权利因而衍生或导致任何第三人向好络维及其关联公司提出任何索赔或请求，或好络维及其关联公司因此而发生任何损失，您同意将足额进行赔偿（包括但不限于合理律师费、诉讼费以及因维权而发生的其他合理费用）。</strong
        >
      </p>
      <p class="article">
        <strong>十四、有效通知</strong>
      </p>
      <p class="article">
        1、好络维向您发出的任何通知，可采用手机短信、电子邮件、页面公开区域公告、个人网络区域提示或常规信件等方式，且该等通知自发送之日即视为已向用户送达或生效。
      </p>
      <p class="article">
        2、您同意，您向好络维发出的任何通知应发至平台对外正式公布的电子邮件、通信地址、传真号码等联系信息，或使用其他好络维认可的其他通知方式进行送达。
      </p>
      <p class="article">
        <strong>十五、争议解决及其他</strong>
      </p>
      <p class="article">
        <strong
          >1、本协议之解释与适用，以及与本协议有关的争议，均应依照中华人民共和国法律予以处理，并同意以杭州市滨江区人民法院为第一审管辖法院。</strong
        >
      </p>
      <p class="article">
        2、如本协议的任何条款被视作无效或无法执行，则上述条款可被分离，其余部份则仍具有法律效力。
      </p>
      <p class="article">
        3、好络维于用户过失或违约时放弃本协议规定的权利的，不得视为其对用户的其他或以后同类之过失或违约行为弃权。
      </p>
      <p class="article">
        4、本协议应取代双方此前就本协议任何事项达成的全部口头和书面协议、安排、谅解和通信。
      </p>
      <p class="article">
        <strong
          >5、好络维有权根据业务调整情况将本协议项下的全部权利义务一并转移给其关联公司或其他第三方，转让将以本协议规定的方式通知，用户承诺对此不持有异议。</strong
        >
      </p>
      <p class="article">
        6、设备采集的生理参数仅供参考，用户在使用设备过程中因意外事件导致的身体损伤或死亡，好络维不承担任何法律责任。
      </p>
      <p class="article">
        7、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。
      </p>
      <p class="article">
        <strong>十六、除非好络维书面许可，您不得从事下列任一行为</strong>
      </p>
      <p class="article">
        <strong>1、删除软件及其副本上关于著作权的信息。</strong>
      </p>
      <p class="article">
        2、对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试发现软件的源代码。
      </p>
      <p class="article">
        3、对好络维拥有知识产权的内容进行使用、出租、出借、复制、修改、链接、转载、汇编、发表、出版、建立镜像站点等。
      </p>
      <p class="article">
        4、对软件或者软件运行过程中释放到任何终端内存中的数据、软件运行过程中客户端与服务器端的交互数据，以及软件运行所必需的系统数据，进行复制、修改、增加、删除、挂接运行或创作任何衍生作品，形式包括但不限于使用插件、外挂或非经好络维授权的第三方工具/服务接入软件和相关系统。
      </p>
      <p class="article">
        5、通过修改或伪造软件运行中的指令、数据等任何方式，增加、删减、变动软件的功能或运行效果，或者将用于上述用途的软件、方法进行运营或向公众传播，无论这些行为是否为商业目的。
      </p>
      <p class="article">
        6、通过非好络维开发、授权的第三方软件、插件、外挂、系统、设备等任何方式，登录或使用好络维软件及服务，或制作、发布、传播非好络维开发、授权的用于登录或使用好络维软件及服务的第三方软件、插件、外挂、系统、设备等。
      </p>
    </section>

    <footer class="next-step">
      <label class="agree">
        <input type="checkbox" v-model="accpet" />
        <span>
          已阅读并同意
          <font class="fb6522">《用户协议》</font>和
          <font class="fb6522">《隐私协议》</font>
        </span>
      </label>
      <a @click="agree" v-if="accpet == true">同意并登录</a>
      <a v-else style="opacity: 0.4;">同意并登录</a>
    </footer>

    <div>
      <van-popup class="aaa" v-model="shownext1">
        <img :src="bg_guide1" alt="1" @click="nextPage(2)" />
      </van-popup>
      <van-popup class="aaa" v-model="shownext2">
        <img :src="bg_guide2" alt="1" @click="nextPage(4)" />
      </van-popup>
      <!--<van-popup class="aaa" v-model="shownext3">
        <img :src="bg_guide3" alt="1" @click="nextPage(4)" />
      </van-popup>-->
      <van-popup class="aaa" v-model="shownext4">
        <img :src="bg_guide4" alt="1" @click="nextPage(5)" />
      </van-popup>
    </div>
  </div>
</template>

<script>
import util from "../../lib/util";

export default {
  data() {
    return {
      shownext1: false,
      shownext2: false,
      shownext3: false,
      shownext4: false,
      accpet: false,
      userInfo: {},
      hw_user_message: {},
      bg_guide1: require('../im_msg/bg_guide1.png'),
      bg_guide2: require('../im_msg/bg_guide2.png'),
      bg_guide3: require('../im_msg/bg_guide3.png'),
      bg_guide4: require('../im_msg/bg_guide4.png')
    };
  },
  created() {
    let userData = localStorage.getItem("hw_user_message");
    this.hw_user_message = JSON.parse(userData);
    this.userInfo = this.$route.params;
  },
  methods: {
    agree() {
      let Url = "";
      let params = {
        reqHead: {
          functionId: "HWW001001005"
        },
        body: {
          managerNo: this.hw_user_message.managerNo
        }
      };
      util.ajax
        .post(Url, params)
        .then(res => {
        })
        .catch(function(error) {
          console.log(error);
        });
      this.nextPage(1);
    },
    nextPage(num) {
      switch (num) {
        case 1:
          this.shownext1 = true;
          break;
        case 2:
          this.shownext2 = true;
          break;
        case 3:
          this.shownext3 = true;
          break;
        case 4:
          this.shownext4 = true;
          break;
        case 5:
          this.$router.push({
            name: "HomePage",
            params: {
              isHwProtocol: this.userInfo.isHwProtocol,
              managerNo: this.userInfo.managerNo,
              userNo: this.userInfo.userNo,
              is_device: 1 //设备使用图解
            }
          });
          break;
        default:
          break;
      }
    }
  }
};
</script>

<style scoped>
.agreement {
  font-size: 16px;
  padding-bottom: 80px;
}

.agreement-article {
  padding: 8px 16px;
}

.title {
  text-align: center;
  font-weight: bold;
  line-height: 48px;
}

.article {
  line-height: 24px;
  margin-bottom: 16px;
}

.next-step {
  position: fixed;
  bottom: 0;
  height: 80px;
  width: 100%;
  background: #eee;
}

.next-step .agree,
.next-step a {
  position: absolute;
  width: 100vw;
  font-size: 16px;
  text-align: center;
}
.next-step .agree {
  bottom: 40px;
  height: 40px;
  line-height: 40px;
  font-size: 14px;
  color: #888;
}
.next-step a {
  bottom: 0;
  height: 40px;
  line-height: 40px;
  color: #fff;
  background-color: #fb6522;
}

.next-step .agree .fb6522 {
  color: #fb6522;
}
.aaa img {
  width: 100vw;
  height: 100vh;
}

/* .next-step .agree input,
.next-step .agree span {
  vertical-align: middle;
} */
</style>
